"""
    สร้างไฟล์ใหม่ใน FOLDER /assighment/week09/lab-assighment-1109.py 

    เครื่องคํานวณค่าไฟฟ้าแบบขั้นบันได
    เขียนโปรแกรมคํานวณค่าไฟฟ้าจากจํานวนหน่วยไฟฟ้าที่ใช้ในเดือนนั้น โดยใช้ฟังก์ชัน calculate_electricity_cost(units)

    ค่าไฟฟ้าขึ้นกับปริมาณการใช้งาน
    จํานวนหน่วยที่ใช้.....อัตราต่อหน่วย
    1-50 หน่วยแรก.......2.50 บาท
    51-100 หน่วย........3.00 บาท
    101-200 หน่วย.......3.50 บาท
    มากกว่า 200 หน่วย....4.00 บาท

    ให้คิดค่าบริการคงเหลือที่เพิ่มอีก 25 บาทต่อเดือน
    เงื่อนไข
            โปรแกรมแสดงเมนูวนซั้า
            ผู้ใช้เลือก 1 เพื่อคํานวณค่าไฟ
            ผู้ใช้เลือก 2 เพื่อออกจากโปรแกรม
            หากเลือกเมนูอื่น ให้แจ้งว่าเลือกเมนูไม่ถูกต้อง
            จํานวนหน่วยไฟฟ้าต้องไม่ติดลบ
            ให้แสดงรายละเอียดค่าไฟแต่ละช่วง และยอดรวมสุทธิ


"""
units = input("กรอกจํานวนหน่วยไฟฟ้า:")
 
def calculate_electricity_cost(units):

    if units > 200:
        cost = 125.0 + 150.00 + 350.00 +((units - 200)) * 4.00) + 25
        print(cost)
     
    elif units > 100:
        cost =(50 * 2.50) + (50 * 3.00) + ((units - 100) * 3.50) + 25
        print("1-50 หน่วย: 125.00บาท")
        print("51-100 หน่วย: 150.00บาท")
        print(f"101-{units} หน่วย: {(units - 100) * 3.50} บาท")
        print("ค่าบริการ: 25.00บาท")
        print("รวมค่าไฟฟ้าทั้งสิ้น:, cost, "บาท")

    elif units > 50:
        cost = 125.0 + ((units - 50) * 3.00) + 25
        print("1-50 หน่วย: 125.00บาท")
        print(f"51-{units} หน่วย: {(units - 50) * 3.00} บาท")
        print("ค่าบริการ: 25.00บาท")
        print("รวมค่าไฟฟ้าทั้งสิ้น:, cost, "บาท")

    elif units >= 0:
        cost = units * 2.50 + 25 
        print(f"{units} หน่วย: {(units) * 2.50} บาท")
        print("ค่าบริการ: 25.00บาท")
        print("รวมค่าไฟฟ้าทั้งสิ้น:, cost, "บาท")

    else: 
         print("จํานวนหน่วยไฟฟ้าต้องไม่ติดลบ")

print("==== โปรแกรมคํานวณไฟฟ้า =====")
print(=1. คํานวณไฟฟ้า=)
print(=2. ออกจากโปรแกรม=)
choice = input("เลือกเมนู: ")
if choice == "1":
    units = int(input("กรอกจํานวนหน่วยไฟฟ้า:"))
    calculate_electricity_cost(units)
elif choice == "2":
    break       