

โจทย์ 1: เครื่องคํานวณอย่างปลอดภัย
เขียนโปรแกรมรับตัวเลข 2 จํานวนและตัวดําเนินการ 1 ตัว ได้แก่ + - * / แล้วแสดงผลลัพธ์
โปรแกรมต้องจัดการกรณีต่อไปนี้
    ผู้ใช้กรอกข้อมูลที่ไม่ใช่ตัวเลข #ValueError
    ผู้ใช้เลือกตัวดําเนินการอื่นนอกจาก + - * / raise ValueError
    ผู้ใช้พยายามหารด้วยศูนย์ #ZeroDivisionError
    โปรแกรมต้องแสดง จบการทํางาน เสมอด้วย finally

ตัวอย่างผลลัพธ์ที่คาดหวัง

ตัวเลขที่ 1: 10
ตัวเลขที่ 2: 0
เครื่องหมาย (+, -, *, /,): /

ไม่สามารถหารด้วยศูนย์ได้
จบการทํางาน


try:
    num = float(input("ตัวเลขที่ 1: "))
    num = float(input("ตัวเลขที่ 2: "))
    operator = input("เครื่องหมาย(+, -, *, /): ")

    result = 0
    if operator == "+":
        result = num1 + num2
    elif operator == "-":
        result = num1 - num2
    elif operator == "*":
        result = num1 * num2
    elif operator == "/":
        result = num1 / num2
    else:
        raise ValueError(เครื่องหมายต้องเป็น + - * / เท่านั้น")
    print(f"{num1} {operator} {num2} = {result}")

except ValueError: #กรณีผู้ใช้ไม่พิมพ์ตัวเลข
    print("กรณากรอกข้อมูลที่เป็นตัวเลขเท่านั้น")

except ZeroDivisionError: #กรณีผู้ใช้ใส่ตัวหารเป็น 0
    print("ไม่สามารถหารด้วยศูนย์ได้")

except Exception: #กรณีอื่นๆ
    print("ทําอะไรไม่ได้บางอย่างแต่ไม่แน่ใจว่าคืออะไร")

else: #จะทําที่นี่ก็ต่อเมื่อไม่มี exception
     print("คํานวณข้อมูลเรียบร้อยแล้ว")

finally: #ทําเสมอไม่ว่าจะมีหรือไม่มี exception เกิดขึ้นก็ตาม
    print("จบการทํางาน")